ПД_sev/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>УИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелеграмИД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелеграмКодАктивации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ПД_sev/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МобильныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзвещатьПоСМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпенсироватьТолькоПереработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доверенности</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ПД_sev/src/CommonModules/УправлениеПользователями/Module.bsl
Функция ПолучитьТаблицуПользователейДляPushУведомлений() Экспорт 
	Запрос = НОвый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	МП_ВнешниеУстройства.Пользователь КАК Пользователь,
	//               |	МП_ВнешниеУстройства.ИДPush КАК ИДPush,
	//               |	МП_ВнешниеУстройства.Пользователь.Сотрудник.АдресЭлектроннойПочты КАК ПользовательСотрудникАдресЭлектроннойПочты,
	//               |	МП_ВнешниеУстройства.Пользователь.Сотрудник.МобильныйТелефон КАК ПользовательСотрудникМобильныйТелефон,
	//               |	МП_ВнешниеУстройства.Пользователь.Сотрудник.ИзвещатьПоСМС КАК ПользовательСотрудникИзвещатьПоСМС,
	//               |	МП_ВнешниеУстройства.Ссылка КАК Устройство
	//               |ИЗ
	//               |	Справочник.МП_ВнешниеУстройства КАК МП_ВнешниеУстройства
	//               |ГДЕ
	//               |	НЕ МП_ВнешниеУстройства.ИДPush = """"
	//               |	И НЕ МП_ВнешниеУстройства.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяССылка)";
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Пользователь,
	               |	Пользователи.ТелеграмИД КАК ТелеграмИД,
	               |	Пользователи.Сотрудник.АдресЭлектроннойПочты КАК ПользовательСотрудникАдресЭлектроннойПочты,
	               |	Пользователи.Сотрудник.МобильныйТелефон КАК ПользовательСотрудникМобильныйТелефон,
	               |	Пользователи.Сотрудник.ИзвещатьПоСМС КАК ПользовательСотрудникИзвещатьПоСМС
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.ТелеграмИД > 0
	               |	И НЕ Пользователи.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьДовереностьПользователя(Сотрудник, Организация) Экспорт 
	Перем ЗначениеВозврата;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СотрудникиДоверенности.Доверенность КАК Доверенность
	               |ИЗ
	               |	Справочник.Сотрудники.Доверенности КАК СотрудникиДоверенности
	               |ГДЕ
	               |	СотрудникиДоверенности.Ссылка = &Сотрудник
	               |	И СотрудникиДоверенности.Организация = &Организация";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник); 				   
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ЗначениеВозврата = Выборка.Доверенность;	
	КонецЕсли;
	
	Возврат ЗначениеВозврата;
КонецФункции
